#include <iostream>
#include <vector>
using namespace std;


int main()
{
    int people [2][6]; // 2 ряда по 6 человек, где 0 - vip.
    int tableWare[12][4] = {{4,1,2,3}, {4,1,2,3},{1,2,3},{1,2,3},{1,2,3},{1,2,3},{1,2,3},{1,2,3},{1,2,3},{1,2,3},{1,2,3},{1,2,3} };  // 12 персон по 4 прибора, где только у VIP ( 0 и 1  элемент) будет ложечка десертная. 1- вилка , 2 - ложка , 3 - нож, 4 - десертная ложка - 0 - если нет десертной ложки.
    int plates[12]={2,2,1,1,1,1,1,1,1,1,1,1}; // 12 персон по 2 тарелки, где у випов( 0 и 1 элементы) будет еще одна десертная. 1 - просто две тарелки, 2 - три тарелки включая десертную.
    vector <int> chairs(12);


    cout << "All 12 guests are arrived!\n";
    cout <<"Child has come.";
    chairs.push_back(1);// one chair added.
    
    


}